Tekla.Structures.Internal.dotMatrix_t
Serialization structure for TransformationPlane.

Tekla.Structures.Internal.dotMatrix_t.aMatrix
Matrix4x3 as an array.

Tekla.Structures.Internal.dotMatrix_t.#ctor(System.Int32)
Creates a new dotMatrix_t instance.
Size: 4x3 elements.

Tekla.Structures.Internal.dotMatrix_t.ToStruct(Tekla.Structures.Geometry3d.Matrix)
Matrix4x3 to struct.
Matrix: Matrix4x3.

Tekla.Structures.Internal.dotMatrix_t.FromStruct(Tekla.Structures.Geometry3d.Matrix)
Matrix4x3 from struct.
Matrix: Matrix4x3.